# GradientNoiseAmount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Gradient..::..GradientNoiseAmount Property
Gradient Class See Also
---
The property labeled "Amount" from the "Gradient" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GradientNoiseAmount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GradientNoiseAmount As String
	Get
```

Visual C++
---
```text
public:
static property String^ GradientNoiseAmount {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".
# See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace